package net.narusas.aceauction.pdf.jpedal;

import java.util.List;

import junit.framework.TestCase;

public class FilterTest extends TestCase {
	/*
	
	
	public void test건물등기부등본002() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/건물등기부등본002.pdf",
				new String[] { "이정순" });

		// print(ok);
		String[][] expected = {
				{ "을11", "false", "2002년10월21일", "소멸기준", "근저당권", "",
						"[중소기업은행]", "금79,400,000원", "설정계약", "금79,400,000원" },
				{ "갑3", "false", "2004년9월3일", "소멸", "압류", "", "[양천세무서]",
						"NONE", "압류(징세1212140-8953)", "NONE" },
				{ "갑5", "false", "2005년2월25일", "소멸", "압류", "", "[고양시일산구]",
						"NONE", "압류(세무13410-2965)", "NONE" },
				{ "갑7", "false", "2006년5월2일", "소멸", "임의경매", "", "[중소기업은행]",
						"NONE", "서울중앙지방법원의경매개시결정(2006타경14449)", "NONE" } };
		assert사항(ok, expected);
	}

	public void test건물등기부등본005() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/건물등기부등본005.pdf",
				new String[] { "이정순" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "1997년7월12일", "소멸", "소유권보존", "소유권보존", "[곽재근]",
						"NONE", "", "NONE" },
				{ "을1", "false", "1997년8월30일", "소멸기준", "근저당권", "",
						"[교보생명보험(주)]", "금일억육천팔백만원", "설정계약", "금일억육천팔백만원" },
				{ "갑3", "false", "1998년2월26일", "소멸", "압류", "", "[서울특별시종로구]",
						"NONE", "압류", "NONE" },
				{ "갑5", "false", "1998년5월8일", "소멸", "압류", "소유권일부(4분의1)",
						"[강남세무서]", "NONE", "압류", "NONE" },
				{ "갑7", "false", "1998년8월11일", "소멸", "가처분", "", "[권인영]",
						"NONE", "서울지방법원의가처분결정(98카합2524)", "NONE" },
				{ "갑8", "false", "1998년8월25일", "인수", "예고등기", "2번소유권말소", "[]",
						"NONE", "서울지방법원에 소제기(98가합69578)", "NONE" },
				{ "을2", "false", "2000년9월23일", "인수", "예고등기", "1번근저당권말소", "[]",
						"NONE", "서울지방법원에소제기(2000가합67469)", "NONE" },
				{ "갑9", "false", "2000년9월30일", "소멸", "압류", "", "[성동세무서]",
						"NONE", "압류(징세46120-6139)", "NONE" },
				{ "갑10", "false", "2000년11월4일", "소멸", "압류", "", "[평택세무서]",
						"NONE", "압류(징세46100-4280)", "NONE" },
				{ "갑11", "false", "2001년1월26일", "소멸", "압류", "", "[종로세무서]",
						"NONE", "압류(징세46120-265)", "NONE" },
				{ "갑13", "false", "2002년3월22일", "소멸", "압류", "", "[평택시]",
						"NONE", "압류(송세13410-10250)", "NONE" },
				{ "갑14", "false", "2003년3월24일", "소멸", "압류", "", "[국민건강보험공단]",
						"NONE", "압류(징급1621-1599)", "NONE" },
				{ "갑15", "false", "2004년5월27일", "소멸", "임의경매", "소유권일부(4분의1)",
						"[]", "NONE", "서울중앙지방법원의경매개시결정(2004타경17697)", "NONE" },
				{ "갑16", "false", "2005년8월8일", "소멸", "압류", "", "[서울특별시]",
						"NONE", "압류(세무과-20653)", "NONE" },
				{ "갑17", "false", "2005년11월10일", "소멸", "압류", "", "[삼성세무서]",
						"NONE", "압류(징세46100-15763)", "NONE" },

		};
		assert사항(ok, expected);
	}

	//
	public void test근저당() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();

		List<사항> ok = parser.parseAll("fixtures/근저당.pdf",
				new String[] { "박성훈" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "1993년9월7일", "소멸", "소유권보존", "소유권보존",
						"[(주)한빛은행, 김해근]", "NONE", "", "NONE" },
				{ "을9", "false", "2002년6월24일", "소멸기준", "근저당권", "", "[(주)국민은행]",
						"금585,000,000원", "설정계약", "금585,000,000원" },
				{ "갑17", "false", "2002년7월6일", "소멸", "가등기", "소유권이전청구권",
						"[최명섭]", "NONE", "매매예약", "NONE" },
				{ "갑18", "false", "2006년8월4일", "소멸", "압류", "",
						"[근로복지공단부산동부지사]", "NONE", "압류(징수6508-78536)", "NONE" },
				{ "갑19", "false", "2006년11월8일", "소멸", "강제경매", "", "[(주)에이디칩스]",
						"NONE", "부산지방법원동부지원의강제경매개시결정(2006타경21311)", "NONE" },
				{ "갑20", "false", "2006년12월1일", "소멸", "압류", "", "[부산광역시해운대구]",
						"NONE", "압류(세무1과-510)", "NONE" },
				{ "갑21", "false", "2007년1월29일", "소멸", "임의경매", "", "[(주)국민은행]",
						"NONE", "부산지방법원동부지원의경매개시결정(2007타경1727)", "NONE" },

		};
		assert사항(ok, expected);
	}

	//	
	public void test근저당가등기() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();

		List<사항> ok = parser.parseAll("fixtures/근저당,가등기.pdf",
				new String[] { "(주)현대부품" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "2004년4월30일", "소멸", "소유권보존", "소유권보존",
						"[(주)현대부품]", "NONE", "", "NONE" },
				{ "을1", "false", "2004년5월13일", "소멸기준", "근저당권", "",
						"[밀알신용협동조합]", "금77,000,000원", "추가설정계약", "금77,000,000원" },
				{ "을2", "false", "2004년5월13일", "소멸", "근저당권", "", "[밀알신용협동조합]",
						"금98,000,000원", "설정계약", "금98,000,000원" },

				{ "갑2", "false", "2004년12월20일", "소멸", "압류", "", "[광주광역시북구]",
						"NONE", "압류(세무과-6426)", "NONE" },

				{ "갑3", "false", "2005년6월17일", "소멸", "가등기", "소유권이전청구권",
						"[나금자]", "NONE", "매매예약", "NONE" },
				{ "갑4", "false", "2005년7월28일", "소멸", "가압류", "", "[(주)광주은행]",
						"금53,240,891원", "광주지방법원의 가압류결정(2005카단12590)",
						"금53,240,891원" },
				{ "갑5", "false", "2005년7월28일", "소멸", "가압류", "", "[신용보증기금]",
						"금40,000,000원", "광주지방법원의 가압류결정(2005카단12591)",
						"금40,000,000원" },
				{ "갑6", "false", "2005년8월1일", "소멸", "가압류", "", "[신용보증기금]",
						"금254,000,000원", "광주지방법원의 가압류결정(2005카단12675)",
						"금254,000,000원" },
				{ "갑8", "false", "2005년8월26일", "소멸", "압류", "", "[북광주세무서]",
						"NONE", "압류(징세-10884)", "NONE" },
				{ "갑3-1", "false", "2005년10월24일", "소멸", "가처분", "3번가등기소유권이전청구권",
						"[신용보증기금]", "NONE", "광주지방법원의가처분결정(2005카단17025)", "NONE" },
				{ "갑9", "false", "2006년1월26일", "소멸", "임의경매", "", "[밀알신용협동조합]",
						"NONE", "광주지방법원의경매개시결정(2006타경2344)", "NONE" },
				{ "갑12", "false", "2006년3월29일", "소멸", "압류", "",
						"[근로복지공단광주지역본부]", "NONE", "압류(징수6508-41256)", "NONE" }, };
		assert사항(ok, expected);
	}

	// public void testc01_2006_13829_1_2() throws Exception {
	// 등기부등본Parser parser = new 등기부등본Parser();
	//
	// List<사항> ok = parser.parseAll("fixtures/c01_2006-13829_1_2.pdf", new
	// String[] { "현대부품" });
	// print(ok);
	// String[][] expected = {
	// {"을1","false","1993년12월24일","소멸기준","근저당권","갑1번,4번이금자지분갑2번,3번박상숙지분갑5번박종호지분각","[조선맥주(주)]","금300,000,000원","설정계약","금300,000,000원"},
	// {"을2","false","1995년2월17일","소멸","근저당권","","[오비맥주(주)]","금이억원","설정계약","금이억원"},
	// {"을3","false","1995년9월19일","소멸","근저당권","","[오비맥주(주)]","금300,000,000원","설정계약","금300,000,000원"},
	// {"을4","false","1995년9월19일","소멸","근저당권","1번,4번이금자,5번박종호지분전부","[박상숙]","금150,000,000원","설정계약","금150,000,000원"},
	// {"갑6","false","1996년6월15일","소멸","압류","이금자,박상숙,박종호지분","[인천광역시]","NONE","압류","NONE"},
	// {"갑7","false","1997년2월1일","소멸","가압류","1번,4번이금자지분","[(주)서울은행]","금3,700,000원","인천지방법원의
	// 가압류결정(97카단2065)","금3,700,000원"},
	// {"갑8","false","1997년6월3일","소멸","압류","5번박종호지분전부","[남인천세무서]","NONE","압류","NONE"},
	// {"갑9","false","1997년12월8일","소멸","압류","1번,4번이금자지분","[남인천세무서]","NONE","압류","NONE"},
	// {"갑10","false","1998년12월22일","소멸","가압류","1번,4번이금자지분전부","[이월하]","금50,000,000원","인천지방법원의
	// 가압류결정(98카단70594)","금50,000,000원"},
	// {"갑11","false","1999년1월14일","소멸","압류","이금자,박상숙,박종호지분전부","[인천광역시남구]","NONE","압류","NONE"},
	// {"갑12","false","1999년11월22일","소멸","압류","5번박종호지분","[인천광역시남구]","NONE","압류(세무13410-3723)","NONE"},
	// {"갑14","false","2000년11월16일","소멸","압류","2번박상숙지분,3번박상숙지분,4번이금자지분,5번박종호지분","[인천광역시남구]","NONE","압류(세무13410-10413)","NONE"},
	// {"갑15","false","2001년5월10일","소멸","압류","2번박상숙지분,3번박상숙지분","[인천광역시남구]","NONE","압류(건지58550-2413)","NONE"},
	// {"갑16","false","2001년5월10일","소멸","압류","5번박종호지분","[인천광역시남구]","NONE","압류(건지58550-2414)","NONE"},
	// {"갑17","false","2001년5월10일","소멸","압류","1번이금자지분,4번이금자지분","[인천광역시남구]","NONE","압류(건지58550-2415)","NONE"},
	// {"갑18","false","2001년5월24일","소멸","압류","1번이금자지분,2번박상숙지분,3번박상숙지분,4번이금자지분,5번박종호지분","[인천광역시남구]","NONE","압류(교통91000-1822)","NONE"},
	// {"갑20","false","2006년3월30일","소멸","임의경매","","[하이트맥주(주)]","NONE","인천지방법원의경매개시결정(2006타경13829)","NONE"},
	//				
	// };
	// assert사항(ok, expected);
	// }

	public void test변경() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();

		List<사항> ok = parser
				.parseAll("fixtures/변경.pdf", new String[] { "하청태" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "2002년10월30일", "소멸", "소유권보존", "소유권보존",
						"[한국자산관리공사, 지분]", "NONE", "", "NONE" },
				{ "을1", "false", "2002년10월31일", "소멸기준", "근저당권", "",
						"[한국자산관리공사]", "금864,000,000원", "설정계약", "금864,000,000원" },
				{ "갑3", "false", "2006년2월9일", "소멸", "압류", "", "[인천광역시남동구]",
						"NONE", "압류(세무과-1963)", "NONE" },
				{ "갑4", "false", "2006년6월26일", "소멸", "임의경매", "", "[(주)우리은행]",
						"NONE", "인천지방법원의경매개시결정(2006타경52237)", "NONE" },

		};
		assert사항(ok, expected);
	}

	//	
	public void testb01_2006_4174_1_2() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();

		List<사항> ok = parser.parseAll("fixtures/b01_2006-4174_1_2.pdf",
				new String[] { "하청태" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "2003년12월27일", "소멸", "소유권보존", "소유권보존",
						"[하청태]", "NONE", "", "NONE" },
				{ "을1", "false", "2003년12월31일", "소멸기준", "근저당권", "",
						"[부산경남양돈협동조합]", "금2,600,000,000원", "설정계약",
						"금2,600,000,000원" },
				{ "을2", "false", "2004년2월19일", "소멸", "근저당권", "",
						"[부산경남양돈협동조합]", "금78,000,000원", "설정계약", "금78,000,000원" },
				{ "을3", "false", "2004년6월21일", "소멸", "근저당권", "", "[이정율, 박진석]",
						"금650,000,000원", "설정계약", "금650,000,000원" },
				{ "갑3", "false", "2004년6월23일", "소멸", "가압류", "", "[송태형]",
						"금33,100,000원", "부산지방법원의 가압류결정(2004카단24418)",
						"금33,100,000원" },
				{ "갑7", "false", "2005년3월18일", "소멸", "가압류", "", "[조종기]",
						"금100,000,000원", "창원지방법원밀양지원의가압류결정(2005카합24)",
						"금100,000,000원" },
				{ "갑11", "false", "2006년1월25일", "소멸", "임의경매", "",
						"[부산경남양돈협동조합]", "NONE", "부산지방법원의경매개시결정(2006타경4174)",
						"NONE" },

		};
		assert사항(ok, expected);
	}

	//
	public void testyj04_2006_4907_1_1() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/j04_2006-4907_1_1.pdf",
				new String[] { "정선화" });
		String[][] expected = {
				{ "갑1", "false", "2001년3월14일", "소멸", "소유권이전", "소유권",
						"[정금자, 정경순, 정경화, 정선화, 정형화, 정미화, 이덕개]", "NONE", "재산상속",
						"NONE" },
				{ "갑4", "false", "2006년3월30일", "소멸기준", "강제경매", "1번정선화지분",
						"[서울보증보험(주)]", "NONE",
						"창원지방법원진주지원의강제경매개시결정(2006타경4907)", "NONE" } };
		assert사항(ok, expected);
	}

	//	
	public void test근저당변경이전() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/근저당 변경 이전.pdf",
				new String[] { "윤귀녀" });
		// print(ok);
		String[][] expected = {
				{ "갑5", "false", "1999년11월4일", "소멸", "소유권이전", "소유권", "[윤귀녀]",
						"NONE", "매매", "NONE" },
				{ "을6", "false", "1999년11월4일", "소멸기준", "근저당권", "", "[(주)국민은행]",
						"금60,000,000원", "설정계약", "금60,000,000원" },
				{ "을7", "false", "2003년12월23일", "소멸", "근저당권", "", "[김산동]",
						"금156,000,000원", "설정계약", "금156,000,000원" },
				{ "갑9", "false", "2006년2월9일", "소멸", "가등기", "소유권이전청구권", "[김상국]",
						"NONE", "매매예약", "NONE" },
				{ "갑10", "false", "2006년12월7일", "소멸", "임의경매", "", "[김산동]",
						"NONE", "서울중앙지방법원의경매개시결정(2006타경41625)", "NONE" }, };
		assert사항(ok, expected);
	}

	public void test테스트2() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/테스트.pdf",
				new String[] { "박정미" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "2002년5월28일", "소멸", "소유권보존", "소유권보존", "[박정미]",
						"NONE", "", "NONE" },
				{ "을1", "false", "2002년9월2일", "소멸기준", "근저당권", "",
						"[서광주농업협동조합]", "금196,000,000원", "설정계약", "금196,000,000원" },
				{ "갑2", "false", "2004년12월20일", "소멸", "압류", "", "[광주광역시북구]",
						"NONE", "압류(세무과-6426)", "NONE" },
				{ "갑3", "false", "2005년6월20일", "소멸", "가등기", "소유권이전청구권",
						"[백영기]", "NONE", "매매예약", "NONE" },
				{ "을2", "false", "2005년6월20일", "소멸", "전세권", "", "[오차남]",
						"금70,000,000원", "설정계약", "금70,000,000원" },
				{ "갑4", "false", "2005년7월27일", "소멸", "가압류", "", "[(주)광주은행]",
						"금10,000,000원", "광주지방법원의 가압류결정(2005카단12525)",
						"금10,000,000원" },
				{ "갑5", "false", "2005년7월29일", "소멸", "가압류", "", "[신용보증기금]",
						"금40,000,000원", "광주지방법원의 가압류결정(2005카단12524)",
						"금40,000,000원" },
				{ "갑6", "false", "2005년8월1일", "소멸", "가압류", "", "[신용보증기금]",
						"금254,000,000원", "광주지방법원의 가압류결정(2005카단12675)",
						"금254,000,000원" },
				{ "갑3-1", "false", "2005년10월24일", "소멸", "가처분", "3번가등기소유권이전청구권",
						"[신용보증기금]", "NONE", "광주지방법원의가처분결정(2005카단17024)", "NONE" },
				{ "갑10", "false", "2006년5월4일", "소멸", "임의경매", "", "[서광주농업협동조합]",
						"NONE", "광주지방법원의경매개시결정(2006타경18547)", "NONE" },
				{ "을3", "false", "2006년5월24일", "소멸", "임차권", "주택", "[황지훈]",
						"NONE", "광주지방법원의임차권등기명령(2006카기1188)", "NONE" }, };
		assert사항(ok, expected);
	}

	//	
	public void test소유권경정2() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/소유권경정2.pdf",
				new String[] { "김철호" });
		// print(ok);
		String[][] expected = {
				{ "갑2", "false", "1997년8월12일", "소멸", "소유권이전", "김인세지분전부이전",
						"[김소군, 김경남, 김철호, 백금녀, 김경애, 김종섭, 김귀녀]", "NONE", "재산상속",
						"NONE" },
				{ "갑3", "false", "1997년8월29일", "소멸", "소유권이전", "공유자전원의지분전부이전",
						"[김철호]", "NONE", "증여", "NONE" },
				{ "을1", "false", "2001년12월7일", "소멸기준", "근저당권", "갑구3번김철호지분전부",
						"[김종섭]", "금50,000,000원", "설정계약", "금50,000,000원" },
				{ "갑5", "false", "2006년3월16일", "소멸", "가압류", "3번김철호지분",
						"[산청군농업협동조합]", "금35,210,499원",
						"창원지방법원진주지원의가압류결정(2006카단939)", "금35,210,499원" },
				{ "갑6", "false", "2006년12월7일", "소멸", "임의경매", "2번김철호지분",
						"[김종섭]", "NONE", "창원지방법원진주지원의경매개시결정(2006타경19558)",
						"NONE" },

		};
		assert사항(ok, expected);
	}

	public void test어려움() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/어려움.pdf",
				new String[] { "박남실" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "2000년2월21일", "소멸", "소유권이전", "소유권", "[박남실]",
						"NONE", "매매", "NONE" },
				{ "을1", "false", "2000년3월8일", "소멸기준", "근저당권", "", "[(주)한빛은행]",
						"금195,000,000원정", "설정계약", "금195,000,000원정" },
				{ "을2", "false", "2000년6월20일", "소멸", "근저당권", "", "[(주)한빛은행]",
						"NONE", "설정계약", "NONE" },
				{ "을3", "false", "2001년1월10일", "소멸", "근저당권", "", "[(주)한빛은행]",
						"NONE", "설정계약", "NONE" },
				{ "을4", "false", "2001년10월29일", "소멸", "근저당권", "", "[(주)한빛은행]",
						"금130,000,000원", "설정계약", "금130,000,000원" },
				{ "갑2", "false", "2006년7월10일", "소멸", "가압류", "", "[삼성카드(주)]",
						"금9,155,819원", "춘천지방법원속초지원의가압류결정(2006카단1102)",
						"금9,155,819원" },
				{ "갑3", "false", "2006년7월25일", "소멸", "가압류", "", "[현대캐피탈(주)]",
						"금5,242,009원", "춘천지방법원속초지원의가압류결정(2006카단1189)",
						"금5,242,009원" },
				{ "갑4", "false", "2006년7월31일", "소멸", "가등기", "소유권이전청구권",
						"[김영선]", "NONE", "매매예약", "NONE" },
				{ "갑5", "false", "2006년7월31일", "소멸", "가압류", "", "[기술신용보증기금]",
						"금107,950,000원", "춘천지방법원속초지원의가압류결정(2006카단1222)",
						"금107,950,000원" },
				{ "갑6", "false", "2006년10월2일", "소멸", "강제경매", "", "[현대캐피탈(주)]",
						"NONE", "춘천지방법원속초지원의강제경매개시결정(2006타경6466)", "NONE" },
				{ "갑7", "false", "2006년10월19일", "소멸", "가압류", "", "[상인컴퓨터(주)]",
						"금5,789,710원", "춘천지방법원속초지원의가압류결정(2006카단1618)",
						"금5,789,710원" },
				{ "갑8", "false", "2006년11월6일", "소멸", "임의경매", "", "[(주)우리은행]",
						"NONE", "춘천지방법원속초지원의경매개시결정(2006타경7162)", "NONE" },
				{ "갑9", "false", "2007년4월20일", "소멸", "압류", "", "[속초세무서]",
						"NONE", "압류(세원관리과-1590)", "NONE" }, };
		assert사항(ok, expected);
	}

	public void test지저분함() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/지저분함.pdf",
				new String[] { "제이에스코리아" });
		// print(ok);
		String[][] expected = {
				{ "을13", "false", "2004년5월13일", "소멸기준", "근저당권", "",
						"[한국자산관리공사]", "금2,470,000,000원", "설정계약",
						"금2,470,000,000원" },
				{ "갑10", "false", "2005년4월19일", "소멸", "가압류", "", "[재석종합건설(주)]",
						"금650,000,000원", "대구지방법원포항지원의 가압류결정(2005카단1747)",
						"금650,000,000원" },
				{ "갑11", "false", "2005년4월26일", "소멸", "가압류", "", "[박순명]",
						"금11,450,000원", "대구지방법원포항지원의 가압류결정(2005카단1858)",
						"금11,450,000원" },
				{ "갑12", "false", "2005년5월18일", "소멸", "가압류", "",
						"[(주)삼정종합시스템]", "금19,792,015원",
						"대구지방법원포항지원의 가압류결정(2005카단2228)", "금19,792,015원" },
				{ "을16", "false", "2005년6월29일", "소멸", "근저당권", "", "[우정건설(주)]",
						"금33,150,000원", "설정계약", "금33,150,000원" },
				{ "갑13", "false", "2005년7월21일", "소멸", "가압류", "",
						"[한국자산관리공사, (주)베스트켐]", "금34,100,000원",
						"대구지방법원포항지원의 가압류결정(2005카단3254)", "금34,100,000원" },
				{ "을17", "false", "2005년8월1일", "소멸", "근저당권", "", "[편도훈]",
						"금100,000,000원", "설정계약", "금100,000,000원" },
				{ "을18", "false", "2005년8월9일", "소멸", "근저당권", "", "[한국전력공사]",
						"금20,000,000원", "설정계약", "금20,000,000원" },
				{ "을19", "false", "2005년8월23일", "소멸", "근저당권", "", "[이금순]",
						"금20,000,000원", "설정계약", "금20,000,000원" },
				{ "갑16", "false", "2006년6월26일", "소멸", "가압류", "", "[이상석]",
						"금100,000,000원", "대구지방법원포항지원의가압류결정(2006카단2004)",
						"금100,000,000원" },
				{ "갑17", "false", "2006년10월25일", "소멸", "압류", "", "[포항세무서]",
						"NONE", "압류(세원관리1과-4474)", "NONE" },
				{ "갑18", "false", "2006년10월26일", "소멸", "임의경매", "", "[(주)대구은행]",
						"NONE", "대구지방법원포항지원의경매개시결정(2006타경12528)", "NONE" },
				{ "갑19", "false", "2006년11월14일", "소멸", "압류", "", "[포항시]",
						"NONE", "압류(북세무과12984)", "NONE" },
				{ "갑20", "false", "2006년11월30일", "소멸", "가압류", "", "[엘지카드(주)]",
						"금18,701,977원", "대구지방법원포항지원의가압류결정(2006카단3824)",
						"금18,701,977원" },
				{ "갑21", "false", "2007년4월16일", "소멸", "압류", "", "[포항시]",
						"NONE", "압류(업무과-수도-3375)", "NONE" },
				{ "갑22", "false", "2007년4월16일", "소멸", "압류", "", "[근로복지공단]",
						"NONE", "압류(징수6508-46463)", "NONE" },

		};
		assert사항(ok, expected);
	}

	//	
	public void test스피드윤광현_2005_19129() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/스피드 윤광현 2005-19129.pdf",
				new String[] { "윤광현" });
		// print(ok);
		String[][] expected = {
				{ "을7", "false", "2001년8월22일", "소멸기준", "근저당권", "", "[(주)한빛은행]",
						"금3,200,000,000원", "설정계약", "금3,200,000,000원" },
				{ "갑40", "false", "2003년4월22일", "소멸", "소유권이전", "소유권", "[윤광현]",
						"NONE", "매매", "NONE" },
				{ "갑43", "false", "2005년3월17일", "소멸", "압류", "", "[강동구]",
						"NONE", "압류(교통관리과-6451)", "NONE" },
				{ "을8", "false", "2005년7월19일", "소멸", "근저당권", "", "[김진영]",
						"금150,000,000원", "설정계약", "금150,000,000원" },
				{ "을9", "false", "2005년7월26일", "소멸", "근저당권", "", "[윤순자]",
						"금40,000,000원", "설정계약", "금40,000,000원" },
				{ "을10", "false", "2005년7월26일", "소멸", "근저당권", "", "[최수진]",
						"금40,000,000원", "설정계약", "금40,000,000원" },
				{ "을11", "false", "2005년7월26일", "소멸", "근저당권", "", "[정광길]",
						"금40,000,000원", "설정계약", "금40,000,000원" },
				{ "을12", "false", "2005년7월26일", "소멸", "근저당권", "", "[유희덕]",
						"금40,000,000원", "설정계약", "금40,000,000원" },
				{ "을13", "false", "2005년8월9일", "소멸", "근저당권", "", "[이옥자]",
						"금30,000,000원", "설정계약", "금30,000,000원" },
				{ "갑45", "false", "2005년9월8일", "소멸", "가압류", "", "[서울신용보증재단]",
						"금42,500,000원", "서울중앙지방법원의가압류결정(2005카단100577)",
						"금42,500,000원" },
				{ "갑46", "false", "2005년11월2일", "소멸", "임의경매", "", "[(주)우리은행]",
						"NONE", "서울동부지방법원의경매개시결정(2005타경19129)", "NONE" },
				{ "갑47", "false", "2005년12월26일", "소멸", "압류", "", "[강동구]",
						"NONE", "압류(징수과-12024)", "NONE" }, };
		assert사항(ok, expected);
	}

	public void test스피드곽종만_2004_17697() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/스피드 곽종만 2004-17697.pdf",
				new String[] { "곽종만" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "1997년7월12일", "소멸", "소유권보존", "소유권보존", "[곽재근]",
						"NONE", "", "NONE" },
				{ "갑2", "false", "1997년8월29일", "소멸", "소유권이전", "소유권", "[곽종만]",
						"NONE", "매매", "NONE" },
				{ "을1", "false", "1997년8월30일", "소멸기준", "근저당권", "",
						"[교보생명보험(주)]", "금일억육천팔백만원", "설정계약", "금일억육천팔백만원" },
				{ "갑3", "false", "1998년2월26일", "소멸", "압류", "", "[서울특별시종로구]",
						"NONE", "압류", "NONE" },
				{ "갑5", "false", "1998년5월8일", "소멸", "압류", "소유권일부(4분의1)",
						"[강남세무서]", "NONE", "압류", "NONE" },
				{ "갑7", "false", "1998년8월11일", "소멸", "가처분", "", "[권인영]",
						"NONE", "서울지방법원의가처분결정(98카합2524)", "NONE" },
				{ "갑8", "false", "1998년8월25일", "인수", "예고등기", "2번소유권말소", "[]",
						"NONE", "서울지방법원에 소제기(98가합69578)", "NONE" },
				{ "을2", "false", "2000년9월23일", "인수", "예고등기", "1번근저당권말소", "[]",
						"NONE", "서울지방법원에소제기(2000가합67469)", "NONE" },
				{ "갑9", "false", "2000년9월30일", "소멸", "압류", "", "[성동세무서]",
						"NONE", "압류(징세46120-6139)", "NONE" },
				{ "갑10", "false", "2000년11월4일", "소멸", "압류", "", "[평택세무서]",
						"NONE", "압류(징세46100-4280)", "NONE" },
				{ "갑11", "false", "2001년1월26일", "소멸", "압류", "", "[종로세무서]",
						"NONE", "압류(징세46120-265)", "NONE" },
				{ "갑13", "false", "2002년3월22일", "소멸", "압류", "", "[평택시]",
						"NONE", "압류(송세13410-10250)", "NONE" },
				{ "갑14", "false", "2003년3월24일", "소멸", "압류", "", "[국민건강보험공단]",
						"NONE", "압류(징급1621-1599)", "NONE" },
				{ "갑15", "false", "2004년5월27일", "소멸", "임의경매", "소유권일부(4분의1)",
						"[]", "NONE", "서울중앙지방법원의경매개시결정(2004타경17697)", "NONE" },
				{ "갑16", "false", "2005년8월8일", "소멸", "압류", "", "[서울특별시]",
						"NONE", "압류(세무과-20653)", "NONE" },
				{ "갑17", "false", "2005년11월10일", "소멸", "압류", "", "[삼성세무서]",
						"NONE", "압류(징세46100-15763)", "NONE" },

		};
		assert사항(ok, expected);
	}

	public void test스피드박양수_2005_30420() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/스피드 박양수 2005-30420.pdf",
				new String[] { "박양수" });
		// print(ok);
		String[][] expected = {
				{ "갑8", "false", "1999년3월6일", "소멸", "소유권이전", "소유권", "[박양수]",
						"NONE", "임의경매로 인한 낙찰", "NONE" },
				{ "을10", "false", "2002년6월18일", "소멸기준", "근저당권", "",
						"[(주)국민은행]", "금670,000,000원", "설정계약", "금670,000,000원" },
				{ "을14", "false", "2004년4월29일", "소멸", "근저당권", "", "[장근주]",
						"금100,000,000원", "설정계약", "금100,000,000원" },
				{ "을15", "false", "2004년8월24일", "소멸", "근저당권", "", "[윤주오]",
						"금100,000,000원", "설정계약", "금100,000,000원" },
				{ "갑19", "false", "2004년8월30일", "소멸", "압류", "", "[삼성세무서]",
						"NONE", "압류(징세46100-3914)", "NONE" },
				{ "을16", "false", "2004년10월26일", "소멸", "근저당권", "", "[(주)우리은행]",
						"금60,000,000원", "설정계약", "금60,000,000원" },
				{ "을17", "false", "2005년2월11일", "소멸", "근저당권", "", "[김승평]",
						"금50,000,000원", "설정계약", "금50,000,000원" },
				{ "갑20", "false", "2005년3월11일", "소멸", "가압류", "", "[신용보증기금]",
						"금297,500,000원", "서울서부지방법원의가압류결정(2005카단3052)",
						"금297,500,000원" },
				{ "갑21", "false", "2005년3월18일", "소멸", "가압류", "", "[중소기업은행]",
						"금54,482,054원", "서울지방법원동부지원의가압류결정(2005카단2478)",
						"금54,482,054원" },
				{ "갑23", "false", "2005년4월29일", "소멸", "가압류", "", "[현대캐피탈(주)]",
						"금3,683,147원", "서울중앙지방법원의가압류결정(2005카단64093)",
						"금3,683,147원" },
				{ "갑24", "false", "2005년6월24일", "소멸", "가압류", "", "[우공식]",
						"금30,000,000원", "서울중앙지방법원의가압류결정(2005카단72934)",
						"금30,000,000원" },
				{ "갑25", "false", "2005년7월27일", "소멸", "압류", "", "[성동세무서]",
						"NONE", "압류(징세과-11503)", "NONE" },
				{ "갑26", "false", "2005년9월1일", "소멸", "임의경매", "", "[(주)국민은행]",
						"NONE", "서울중앙지방법원의경매개시결정(2005타경30420)", "NONE" },
				{ "갑27", "false", "2005년9월5일", "소멸", "가압류", "", "[(주)국민은행]",
						"금27,190,808원", "서울중앙지방법원의가압류결정(2005카단100071)",
						"금27,190,808원" },
				{ "갑28", "false", "2005년9월14일", "소멸", "가압류", "", "[김계봉, 김기정]",
						"금30,000,000원", "서울중앙지방법원의가압류결정(2005카단100547)",
						"금30,000,000원" },
				{ "갑29", "false", "2006년6월12일", "소멸", "압류", "", "[서울특별시강남구청]",
						"NONE", "압류(세무1과-7085)", "NONE" },
				{ "갑30", "false", "2006년8월7일", "소멸", "강제경매", "", "[현대캐피탈(주)]",
						"NONE", "서울중앙지방법원의강제경매개시결정(2006타경27810)", "NONE" },

		};
		assert사항(ok, expected);
	}

	//	
	public void test스피드신협지역주택조합_2006_2287() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/스피드 신협지역주택조합 2006-2287.pdf",
				new String[] { "신협지역주택조합" });
		// print(ok);
		String[][] expected = {
				// {"을21","false","2000년12월20일","소멸","근저당권","한영자지분전부","[(주)국민은행]","NONE","설정계약","NONE"},
				{ "갑90", "false", "2002년5월16일", "소멸", "소유권이전", "16번이석재지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑91", "false", "2002년5월16일", "소멸", "소유권이전", "75번변종덕지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑92", "false", "2002년5월16일", "소멸", "소유권이전", "83번지대현지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑93", "false", "2002년5월16일", "소멸", "소유권이전", "87번김향정지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑94", "false", "2002년5월16일", "소멸", "소유권이전", "71번홍재성지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑95", "false", "2002년5월16일", "소멸", "소유권이전", "42번방한봉지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑96", "false", "2002년5월16일", "소멸", "소유권이전", "76번이응섭지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑97", "false", "2002년5월16일", "소멸", "소유권이전", "43번김순금지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑98", "false", "2002년5월16일", "소멸", "소유권이전", "33번박정규지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑99", "false", "2002년5월16일", "소멸", "소유권이전", "67번김석주지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑100", "false", "2002년5월16일", "소멸", "소유권이전", "72번홍군표지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑101", "false", "2002년5월16일", "소멸", "소유권이전", "86번박오수지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑102", "false", "2002년5월16일", "소멸", "소유권이전", "19번이동휘지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑103", "false", "2002년5월16일", "소멸", "소유권이전", "77번김형철지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑104", "false", "2002년5월16일", "소멸", "소유권이전", "88번양정례지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑105", "false", "2002년5월16일", "소멸", "소유권이전", "85번신종국지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑106", "false", "2002년5월16일", "소멸", "소유권이전", "권병윤지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑107", "false", "2002년5월16일", "소멸", "소유권이전", "89번한일규지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑108", "false", "2002년5월16일", "소멸", "소유권이전", "80번이옥란지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑109", "false", "2002년5월16일", "소멸", "소유권이전", "74번민영재지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑110", "false", "2002년5월16일", "소멸", "소유권이전", "78번우봉제지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑111", "false", "2002년5월16일", "소멸", "소유권이전", "한영자지분전부이전",
						"[신협지역주택조합]", "NONE", "신탁", "NONE" },
				{ "갑120", "false", "2006년3월8일", "소멸", "임의경매", "90번신협지역주택조합지분",
						"[(주)국민은행]", "NONE", "수원지방법원성남지원의경매개시결정(2006타경4023)",
						"NONE" },
				{ "갑122", "false", "2006년7월3일", "소멸", "임의경매", "106번신협지역주택조합지분",
						"[(주)국민은행]", "NONE", "수원지방법원성남지원의경매개시결정(2006타경2287)",
						"NONE" },

		};
		assert사항(ok, expected);
	}

	public void test지분경매() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/지분경매.pdf",
				new String[] { "조영철" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "1992년3월13일", "소멸", "소유권이전", "공유자전원의지분전부이전",
						"[윤혜영, 조영철]", "NONE", "매매", "NONE" },
				{ "을1", "false", "1993년1월8일", "소멸기준", "근저당권", "", "[윤용은]",
						"금50,000,000원", "설정계약", "금50,000,000원" },
				{ "을2", "false", "2006년1월25일", "소멸", "근저당권", "갑구1번조영철지분전부",
						"[한건수]", "금50,000,000원", "설정계약", "금50,000,000원" },
				{ "갑3", "false", "2006년9월22일", "소멸", "압류", "1번조영철지분",
						"[의정부세무서]", "NONE", "압류(세원관리4과-129)", "NONE" },
				{ "갑4", "false", "2006년11월3일", "소멸", "임의경매", "1번조영철지분",
						"[한건수]", "NONE", "의정부지방법원의경매개시결정(2006타경46462)", "NONE" },
				{ "갑5", "false", "2006년11월14일", "소멸", "압류", "1번조영철지분",
						"[의정부시]", "NONE", "압류(세무과-6928)", "NONE" },

		};
		assert사항(ok, expected);
	}

	public void test지분경매1() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/지분경매1.pdf",
				new String[] { "조성계" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "1997년11월21일", "소멸", "소유권이전", "소유권",
						"[조성계, 강영규]", "NONE", "매매", "NONE" },
				{ "을3", "false", "2005년4월25일", "소멸", "근저당권", "갑구1번조성계지분전부",
						"[박양애, 이강서]", "금75,000,000원", "설정계약", "금75,000,000원" },
				{ "갑4", "false", "2006년11월13일", "소멸", "임의경매", "1번조성계지분",
						"[박양애, 이강서]", "NONE", "의정부지방법원의경매개시결정(2006타경47922)",
						"NONE" },

		};
		assert사항(ok, expected);
	}

	public void test지분경매2() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/지분경매2.pdf",
				new String[] { "오수명" });
		// print(ok);
		String[][] expected = {
				{ "을1", "false", "2003년8월8일", "인수", "전세권", "", "[이현석]",
						"금50,000,000원", "설정계약", "금50,000,000원" },
				{ "갑4", "false", "2004년1월9일", "소멸", "소유권이전", "소유권",
						"[오은란, 오명철, 오재엽, 오재명, 오수명, 오명순, 오금란]", "NONE", "상속",
						"NONE" },
				{ "갑5", "false", "2004년1월15일", "소멸기준", "가압류", "4번오수명지분",
						"[장성농업협동조합]", "금31,238,977원",
						"광주지방법원의 가압류결정(2004카단725)", "금31,238,977원" },
				{ "갑6", "false", "2004년7월3일", "소멸", "가압류", "4번오수명지분",
						"[파산자장성신용협동조합의파산관재인예금보험공사]", "금20,000,000원",
						"광주지방법원의 가압류결정(2004카단15276)", "금20,000,000원" },
				{ "갑7", "false", "2004년9월15일", "소멸", "압류", "4번오수명지분", "[장성군]",
						"NONE", "압류(재무과-7521)", "NONE" },
				{ "갑8", "false", "2006년1월31일", "소멸", "강제경매", "4번오수명지분",
						"[파산자장성신용협동조합의파산관재인예금보험공사]", "NONE",
						"광주지방법원의강제경매개시결정(2006타경4210)", "NONE" },
				{ "갑9", "false", "2006년2월10일", "소멸", "가압류", "4번오수명지분",
						"[서울, 리기관), (장성축산업협동조합), 농업협동조합중앙회(농림수산업자신용보증기금관]",
						"금66,271,289원", "광주지방법원의 가압류결정(2006카단1719)",
						"금66,271,289원" },

		};
		assert사항(ok, expected);
	}

	public void test공유자() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/공유자.pdf",
				new String[] { "임정안" });
		// print(ok);
		// String[][] expected = {
		// {"을1","false","2003년8월8일","인수","전세권","","[이현석]","금50,000,000원","설정계약","금50,000,000원"},
		// {"갑4","false","2004년1월9일","소멸","소유권이전","소유권","[오은란, 오명철, 오재엽, 오재명,
		// 오수명, 오명순, 오금란]","NONE","상속","NONE"},
		// {"갑5","false","2004년1월15일","소멸기준","가압류","4번오수명지분","[장성농업협동조합]","금31,238,977원","광주지방법원의
		// 가압류결정(2004카단725)","금31,238,977원"},
		// {"갑6","false","2004년7월3일","소멸","가압류","4번오수명지분","[파산자장성신용협동조합의파산관재인예금보험공사]","금20,000,000원","광주지방법원의
		// 가압류결정(2004카단15276)","금20,000,000원"},
		// {"갑7","false","2004년9월15일","소멸","압류","4번오수명지분","[장성군]","NONE","압류(재무과-7521)","NONE"},
		// {"갑8","false","2006년1월31일","소멸","4번오수명지분강제경매개시결정","4번오수명지분강제경매개시결정","[파산자장성신용협동조합의파산관재인예금보험공사]","NONE","광주지방법원의강제경매개시결정(2006타경4210)","NONE"},
		// {"갑9","false","2006년2월10일","소멸","가압류","4번오수명지분","[서울, 리기관),
		// (장성축산업협동조합), 농업협동조합중앙회(농림수산업자신용보증기금관]","금66,271,289원","광주지방법원의
		// 가압류결정(2006카단1719)","금66,271,289원"},
		//
		//
		// };
		// assert사항(ok, expected);
	}

	public void test공유자2() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/공유자2.pdf",
				new String[] { "하병수" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "1993년2월25일", "소멸", "소유권보존", "소유권보존",
						"[(주)현대훼미리타운]", "NONE", "", "NONE" },
				{ "갑2", "false", "1993년8월5일", "소멸", "소유권이전", "소유권일부이전",
						"[하병수]", "NONE", "매매", "NONE" },
				{ "갑4", "false", "2001년2월8일", "소멸", "가압류", "2번하병수지분전부",
						"[한국자산관리공사]", "금26,729,986원",
						"부산지방법원의가압류결정(2001카단2521)", "금26,729,986원" },
				{ "갑6", "false", "2006년11월16일", "소멸", "강제경매", "2번하병수지분",
						"[한국자산관리공사]", "NONE",
						"춘천지방법원속초지원의강제경매개시결정(2006타경7445)", "NONE" },

		};
		assert사항(ok, expected);
	}

	public void test서울보존등기문제a01_2007_2634_1_5() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll(
				"fixtures/서울 보존등기문제 a01_2007-2634_1_5[1].pdf",
				new String[] { "전정화" });
		// print(ok);
		// String[][] expected = {
		// {"갑1","false","1993년2월25일","소멸","소유권보존","소유권보존","[(주)현대훼미리타운]","NONE","","NONE"},
		// {"갑2","false","1993년8월5일","소멸","소유권이전","소유권일부이전","[하병수]","NONE","매매","NONE"},
		// {"갑4","false","2001년2월8일","소멸","가압류","2번하병수지분전부","[한국자산관리공사]","금26,729,986원","부산지방법원의가압류결정(2001카단2521)","금26,729,986원"},
		// {"갑6","false","2006년11월16일","소멸","2번하병수지분강제경매개시결정","2번하병수지분강제경매개시결정","[한국자산관리공사]","NONE","춘천지방법원속초지원의강제경매개시결정(2006타경7445)","NONE"},
		//
		//
		// };
		// assert사항(ok, expected);
	}

	public void test서울등기목적오류() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll(
				"fixtures/서울 등기목적오류 a01_2007-1006_1_2[1].pdf",
				new String[] { "노광열" });

		// print(ok);
		// for (사항 사항 : ok) {
		// System.out.println(사항);
		// }
		String[][] expected = {
				{ "갑2", "false", "2002년9월5일", "소멸", "소유권이전", "소유권",
						"[유명순, 노광석, 노광윤, 노광숙, 노광례, 노광란, 노광분, 노광열, 노광민]",
						"NONE", "상속", "NONE" },
				{ "갑9", "false", "2006년12월15일", "소멸", "가압류", "2번노광열지분",
						"[경기신용보증재단]", "금210,698,075원",
						"수원지방법원의 가압류결정(2006카단104568)", "금210,698,075원" },
				{ "갑11", "false", "2006년12월22일", "소멸", "가압류", "2번노광열지분",
						"[농업협동조합중앙회]", "금71,708,834원",
						"서울중앙지방법원의가압류결정(2006카단105497)", "금71,708,834원" },
				{ "갑12", "false", "2006년12월29일", "소멸", "가압류", "2번노광열지분",
						"[삼성카드(주)]", "금19,151,283원",
						"서울중앙지방법원의가압류결정(2006카단107656)", "금19,151,283원" },
				{ "갑13", "false", "2007년1월10일", "소멸", "강제경매", "2번노광열지분",
						"[농업협동조합중앙회]", "NONE", "서울중앙지방법원의강제경매개시결정(2007타경1006)",
						"NONE" }, };
		assert사항(ok, expected);
	}

	public void test공유자이름() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/2006-6190_공유자이름.pdf",
				new String[] { "김성철" });
		// print(ok);
		String[][] expected = {
				{ "을4", "false", "2000년7월14일", "인수", "전세권", "", "[김응규]",
						"NONE", "설정계약", "NONE" },
				{ "갑55", "false", "2003년5월7일", "소멸", "소유권이전", "소유권",
						"[김성철, 정배호, 이준규]", "NONE", "매매", "NONE" },
				{ "을17", "false", "2003년5월7일", "소멸기준", "근저당권", "",
						"[남부농업협동조합]", "금2,660,000,000원", "설정계약",
						"금2,660,000,000원" },
				{ "을18", "false", "2003년5월7일", "소멸", "근저당권", "", "[남부농업협동조합]",
						"금2,660,000,000원", "설정계약", "금2,660,000,000원" },
				{ "을19", "false", "2003년5월7일", "소멸", "근저당권", "", "[남부농업협동조합]",
						"금1,680,000,000원", "설정계약", "금1,680,000,000원" },
				{ "갑61", "false", "2003년6월30일", "소멸", "가등기", "55번김성철지분전부이전청구권",
						"[한필수, 양태열]", "NONE", "매매예약", "NONE" },
				{ "을21", "false", "2003년6월30일", "소멸", "근저당권", "갑구55번김성철지분전부",
						"[김종삼]", "금100,000,000원", "설정계약", "금100,000,000원" },
				{ "갑62", "false", "2003년7월7일", "소멸", "가압류", "55번김성철지분",
						"[(주)우리은행]", "금700,000,000원",
						"서울지방법원의 가압류결정(2003카단145682)", "금700,000,000원" },
				{ "갑64", "false", "2003년9월29일", "소멸", "가압류", "55번김성철지분",
						"[명영근]", "금50,000,000원",
						"춘천지방법원속초지원의 가압류결정(2003카단2621)", "금50,000,000원" },
				{ "갑65", "false", "2003년10월22일", "소멸", "가압류", "55번김성철지분",
						"[창신2동새마을금고]", "금317,268,160원",
						"서울지방법원의 가압류결정(2003카단208659)", "금317,268,160원" },
				{ "갑66", "false", "2003년10월31일", "소멸", "가압류", "55번김성철지분",
						"[윤영호]", "금25,000,000원",
						"춘천지방법원속초지원의 가압류결정(2003카단3091)", "금25,000,000원" },
				{ "갑67", "false", "2003년11월11일", "소멸", "가압류", "55번김성철지분",
						"[이창훈]", "금11,500,000원",
						"춘천지방법원속초지원의 가압류결정(2003카단3074)", "금11,500,000원" },
				{ "갑68", "false", "2004년2월20일", "소멸", "압류", "55번김성철지분",
						"[금천세무서]", "NONE", "압류(징세46120-1273)", "NONE" },
				{ "을4-1", "false", "2004년3월4일", "소멸", "근저당권", "4번전세권",
						"[속초새마을금고]", "금104,000,000원", "설정계약", "금104,000,000원" },
				{ "갑70", "false", "2004년7월12일", "소멸", "압류", "55번김성철지분",
						"[용산세무서]", "NONE", "압류(징세6482)", "NONE" },
				{ "갑75", "false", "2006년4월14일", "소멸", "압류", "55번김성철지분",
						"[속초시]", "NONE", "압류(세무과-2834)", "NONE" },
				{ "갑78", "false", "2006년9월19일", "소멸", "임의경매", "",
						"[남서울농업협동조합]", "NONE", "춘천지방법원속초지원의경매개시결정(2006타경6190)",
						"NONE" },

		};
		assert사항(ok, expected);
	}

	public void test연속말소_페이지넘어가는것() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/6-1539_연속말소.pdf",
				new String[] { "김송자" });
		// print(ok);
		// String[][] expected = {
		// {"을4","false","2000년7월14일","인수","전세권","","[김응규]","NONE","설정계약","NONE"},
		// {"갑55","false","2003년5월7일","소멸","소유권이전","소유권","[김성철, 정배호,
		// 이준규]","NONE","매매","NONE"},
		// {"을17","false","2003년5월7일","소멸기준","근저당권","","[남부농업협동조합]","금2,660,000,000원","설정계약","금2,660,000,000원"},
		// {"을18","false","2003년5월7일","소멸","근저당권","","[남부농업협동조합]","금2,660,000,000원","설정계약","금2,660,000,000원"},
		// {"을19","false","2003년5월7일","소멸","근저당권","","[남부농업협동조합]","금1,680,000,000원","설정계약","금1,680,000,000원"},
		// {"갑61","false","2003년6월30일","소멸","가등기","55번김성철지분전부이전청구권","[한필수,
		// 양태열]","NONE","매매예약","NONE"},
		// {"을21","false","2003년6월30일","소멸","근저당권","갑구55번김성철지분전부","[김종삼]","금100,000,000원","설정계약","금100,000,000원"},
		// {"갑62","false","2003년7월7일","소멸","가압류","55번김성철지분","[(주)우리은행]","금700,000,000원","서울지방법원의
		// 가압류결정(2003카단145682)","금700,000,000원"},
		// {"갑64","false","2003년9월29일","소멸","가압류","55번김성철지분","[명영근]","금50,000,000원","춘천지방법원속초지원의
		// 가압류결정(2003카단2621)","금50,000,000원"},
		// {"갑65","false","2003년10월22일","소멸","가압류","55번김성철지분","[창신2동새마을금고]","금317,268,160원","서울지방법원의
		// 가압류결정(2003카단208659)","금317,268,160원"},
		// {"갑66","false","2003년10월31일","소멸","가압류","55번김성철지분","[윤영호]","금25,000,000원","춘천지방법원속초지원의
		// 가압류결정(2003카단3091)","금25,000,000원"},
		// {"갑67","false","2003년11월11일","소멸","가압류","55번김성철지분","[이창훈]","금11,500,000원","춘천지방법원속초지원의
		// 가압류결정(2003카단3074)","금11,500,000원"},
		// {"갑68","false","2004년2월20일","소멸","압류","55번김성철지분","[금천세무서]","NONE","압류(징세46120-1273)","NONE"},
		// {"을4-1","false","2004년3월4일","소멸","근저당권","4번전세권","[속초새마을금고]","금104,000,000원","설정계약","금104,000,000원"},
		// {"갑70","false","2004년7월12일","소멸","압류","55번김성철지분","[용산세무서]","NONE","압류(징세6482)","NONE"},
		// {"갑75","false","2006년4월14일","소멸","압류","55번김성철지분","[속초시]","NONE","압류(세무과-2834)","NONE"},
		// {"갑78","false","2006년9월19일","소멸","임의경매","","[남서울농업협동조합]","NONE","춘천지방법원속초지원의경매개시결정(2006타경6190)","NONE"},
		//
		// };
		// assert사항(ok, expected);
	}

	public void test공유자이름2() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll(
				"fixtures/a02_2006-17298_1_5_공유자이름_박종덕.pdf",
				new String[] { "박종덕" });
		// print(ok);
		// String[][] expected = {
		// {"을4","false","2000년7월14일","인수","전세권","","[김응규]","NONE","설정계약","NONE"},
		// {"갑55","false","2003년5월7일","소멸","소유권이전","소유권","[김성철, 정배호,
		// 이준규]","NONE","매매","NONE"},
		// {"을17","false","2003년5월7일","소멸기준","근저당권","","[남부농업협동조합]","금2,660,000,000원","설정계약","금2,660,000,000원"},
		// {"을18","false","2003년5월7일","소멸","근저당권","","[남부농업협동조합]","금2,660,000,000원","설정계약","금2,660,000,000원"},
		// {"을19","false","2003년5월7일","소멸","근저당권","","[남부농업협동조합]","금1,680,000,000원","설정계약","금1,680,000,000원"},
		// {"갑61","false","2003년6월30일","소멸","가등기","55번김성철지분전부이전청구권","[한필수,
		// 양태열]","NONE","매매예약","NONE"},
		// {"을21","false","2003년6월30일","소멸","근저당권","갑구55번김성철지분전부","[김종삼]","금100,000,000원","설정계약","금100,000,000원"},
		// {"갑62","false","2003년7월7일","소멸","가압류","55번김성철지분","[(주)우리은행]","금700,000,000원","서울지방법원의
		// 가압류결정(2003카단145682)","금700,000,000원"},
		// {"갑64","false","2003년9월29일","소멸","가압류","55번김성철지분","[명영근]","금50,000,000원","춘천지방법원속초지원의
		// 가압류결정(2003카단2621)","금50,000,000원"},
		// {"갑65","false","2003년10월22일","소멸","가압류","55번김성철지분","[창신2동새마을금고]","금317,268,160원","서울지방법원의
		// 가압류결정(2003카단208659)","금317,268,160원"},
		// {"갑66","false","2003년10월31일","소멸","가압류","55번김성철지분","[윤영호]","금25,000,000원","춘천지방법원속초지원의
		// 가압류결정(2003카단3091)","금25,000,000원"},
		// {"갑67","false","2003년11월11일","소멸","가압류","55번김성철지분","[이창훈]","금11,500,000원","춘천지방법원속초지원의
		// 가압류결정(2003카단3074)","금11,500,000원"},
		// {"갑68","false","2004년2월20일","소멸","압류","55번김성철지분","[금천세무서]","NONE","압류(징세46120-1273)","NONE"},
		// {"을4-1","false","2004년3월4일","소멸","근저당권","4번전세권","[속초새마을금고]","금104,000,000원","설정계약","금104,000,000원"},
		// {"갑70","false","2004년7월12일","소멸","압류","55번김성철지분","[용산세무서]","NONE","압류(징세6482)","NONE"},
		// {"갑75","false","2006년4월14일","소멸","압류","55번김성철지분","[속초시]","NONE","압류(세무과-2834)","NONE"},
		// {"갑78","false","2006년9월19일","소멸","임의경매","","[남서울농업협동조합]","NONE","춘천지방법원속초지원의경매개시결정(2006타경6190)","NONE"},
		//
		// };
		// assert사항(ok, expected);
	}

	public void test소유권보존_이름_지분() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/소유권보존 지분.pdf",
				new String[] { "나승열" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "2004년10월7일", "소멸", "소유권보존", "소유권보존",
						"[나윤주, 변강섭]", "NONE", "", "NONE" },
				{ "을1", "false", "2005년8월29일", "소멸기준", "근저당권", "",
						"[서울, 파산자새한종합금융(주)의파산관재인예금, 보험공사]", "금6,943,000,000원",
						"설정계약", "금6,943,000,000원" },
				{ "갑4", "false", "2006년3월17일", "소멸", "임의경매", "",
						"[서울, 공사, 파산자새한종합금융(주)의파산관재인예금보험]", "NONE",
						"서울남부지방법원의경매개시결정(2006타경8228)", "NONE" },

		};
		assert사항(ok, expected);
	}

	public void test소유권보존_이름_주소3() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser.parseAll("fixtures/소유권보존 주소3.pdf",
				new String[] { "박준식" });
		// print(ok);
		String[][] expected = {
				{ "갑1", "false", "2004년4월14일", "소멸", "소유권보존", "소유권보존", "[김경임]",
						"NONE", "", "NONE" },
				{ "갑9", "false", "2005년9월13일", "소멸", "소유권이전", "소유권", "[박준식]",
						"NONE", "매매", "NONE" },
				{ "을5", "false", "2005년9월13일", "소멸기준", "근저당권", "",
						"[한국주택금융공사]", "금210,000,000원", "설정계약", "금210,000,000원" },
				{ "갑10", "false", "2006년3월28일", "소멸", "압류", "", "[서울특별시구로구]",
						"NONE", "압류(세일13410-2894)", "NONE" },
				{ "갑11", "false", "2006년9월22일", "소멸", "가압류", "", "[(주)우리은행]",
						"금28,520,750원", "서울중앙지방법원의가압류결정(2006카단83293)",
						"금28,520,750원" },
				{ "갑12", "false", "2007년1월4일", "소멸", "임의경매", "", "[한국주택금융공사]",
						"NONE", "서울남부지방법원의경매개시결정(2006타경39642)", "NONE" },

		};
		assert사항(ok, expected);
	}

	public void test권리전부이전() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser
				.parseAll("fixtures/전부이전.pdf", new String[] { "국" });
//		print(ok);
		String[][] expected = {
				{ "갑1", "false", "1995년2월23일", "소멸", "소유권보존", "소유권보존",
						"[(주)한미은행, 한광동]", "NONE", "", "NONE" },
				{ "을4", "false", "2000년12월22일", "소멸기준", "근저당권", "", "[중소기업은행]",
						"삼억육천만원", "설정계약", "삼억육천만원" },
				{ "을5", "false", "2001년9월20일", "소멸", "근저당권", "", "[중소기업은행]",
						"금500,000,000원", "설정계약", "금500,000,000원" },
				{ "을9", "false", "2006년7월3일", "소멸", "근저당권", "", "[중소기업은행]",
						"금100,000,000원", "설정계약", "금100,000,000원" },
				{ "을10", "false", "2006년11월17일", "소멸", "근저당권", "", "[신용보증기금]",
						"금300,000,000원", "설정계약", "금300,000,000원" },
				{ "을11", "false", "2006년11월24일", "소멸", "근저당권", "", "[나토상사]",
						"금100,000,000원", "설정계약", "금100,000,000원" },
				{ "갑2", "false", "2006년11월29일", "소멸", "가압류", "",
						"[(주)한미은행, 기술신용보증기금]", "금265,000,000원",
						"의정부지방법원의가압류결정(2006카단51083)", "금265,000,000원" },
				{ "갑3", "false", "2006년12월6일", "소멸", "가압류", "",
						"[(주)한미은행, 경기신용보증재단]", "금56,644,000원",
						"의정부지방법원의가압류결정(2006카단7518)", "금56,644,000원" },
				{ "을10-1", "false", "2007년1월8일", "소멸", "가처분", "10번근저당권",
						"[기술신용보증기금]", "NONE", "의정부지방법원의가처분결정(2006카합878)",
						"NONE" },
				{ "을11-1", "false", "2007년1월8일", "소멸", "가처분", "11번근저당권",
						"[기술신용보증기금]", "NONE", "의정부지방법원의가처분결정(2006카합878)",
						"NONE" },
				{ "갑4", "false", "2007년1월22일", "소멸", "가압류", "", "[(주)국민은행]",
						"금476,213,642원", "서울중앙지방법원의가압류결정(2007카단32766)",
						"금476,213,642원" },
				{ "갑5", "false", "2007년1월29일", "소멸", "임의경매", "", "[중소기업은행]",
						"NONE", "서울중앙지방법원의경매개시결정(2007타경2764)", "NONE" },
				{ "갑6", "false", "2007년2월8일", "소멸", "가압류", "", "[서울보증보험(주)]",
						"금56,072,770원", "서울중앙지방법원의가압류결정(2007카단37260)",
						"금56,072,770원" },
				{ "갑7", "false", "2007년2월23일", "소멸", "가압류", "", "[서울보증보험(주)]",
						"금9,089,600원", "서울중앙지방법원의가압류결정(2007카단40290)",
						"금9,089,600원" },
				{ "갑8", "false", "2007년3월7일", "소멸", "압류", "", "[의정부세무서]",
						"NONE", "압류(세원관리3과-956)", "NONE" },
				{ "갑9", "false", "2007년4월2일", "소멸", "가압류", "", "[신용보증기금]",
						"금571,378,208원", "의정부지방법원의가압류결정(2007카단50308)",
						"금571,378,208원" }, };
		assert사항(ok, expected);
	}

	
	public void test한글금액() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<사항> ok = parser
				.parseAll("fixtures/한글금액.pdf", new String[] { "국" });
//		print(ok);
//		String[][] expected = {
//				{ "갑1", "false", "1995년2월23일", "소멸", "소유권보존", "소유권보존",
//						"[(주)한미은행, 한광동]", "NONE", "", "NONE" },
//				{ "을4", "false", "2000년12월22일", "소멸기준", "근저당권", "", "[중소기업은행]",
//						"삼억육천만원", "설정계약", "삼억육천만원" },
//				{ "을5", "false", "2001년9월20일", "소멸", "근저당권", "", "[중소기업은행]",
//						"금500,000,000원", "설정계약", "금500,000,000원" },
//				{ "을9", "false", "2006년7월3일", "소멸", "근저당권", "", "[중소기업은행]",
//						"금100,000,000원", "설정계약", "금100,000,000원" },
//				{ "을10", "false", "2006년11월17일", "소멸", "근저당권", "", "[신용보증기금]",
//						"금300,000,000원", "설정계약", "금300,000,000원" },
//				{ "을11", "false", "2006년11월24일", "소멸", "근저당권", "", "[나토상사]",
//						"금100,000,000원", "설정계약", "금100,000,000원" },
//				{ "갑2", "false", "2006년11월29일", "소멸", "가압류", "",
//						"[(주)한미은행, 기술신용보증기금]", "금265,000,000원",
//						"의정부지방법원의가압류결정(2006카단51083)", "금265,000,000원" },
//				{ "갑3", "false", "2006년12월6일", "소멸", "가압류", "",
//						"[(주)한미은행, 경기신용보증재단]", "금56,644,000원",
//						"의정부지방법원의가압류결정(2006카단7518)", "금56,644,000원" },
//				{ "을10-1", "false", "2007년1월8일", "소멸", "가처분", "10번근저당권",
//						"[기술신용보증기금]", "NONE", "의정부지방법원의가처분결정(2006카합878)",
//						"NONE" },
//				{ "을11-1", "false", "2007년1월8일", "소멸", "가처분", "11번근저당권",
//						"[기술신용보증기금]", "NONE", "의정부지방법원의가처분결정(2006카합878)",
//						"NONE" },
//				{ "갑4", "false", "2007년1월22일", "소멸", "가압류", "", "[(주)국민은행]",
//						"금476,213,642원", "서울중앙지방법원의가압류결정(2007카단32766)",
//						"금476,213,642원" },
//				{ "갑5", "false", "2007년1월29일", "소멸", "임의경매", "", "[중소기업은행]",
//						"NONE", "서울중앙지방법원의경매개시결정(2007타경2764)", "NONE" },
//				{ "갑6", "false", "2007년2월8일", "소멸", "가압류", "", "[서울보증보험(주)]",
//						"금56,072,770원", "서울중앙지방법원의가압류결정(2007카단37260)",
//						"금56,072,770원" },
//				{ "갑7", "false", "2007년2월23일", "소멸", "가압류", "", "[서울보증보험(주)]",
//						"금9,089,600원", "서울중앙지방법원의가압류결정(2007카단40290)",
//						"금9,089,600원" },
//				{ "갑8", "false", "2007년3월7일", "소멸", "압류", "", "[의정부세무서]",
//						"NONE", "압류(세원관리3과-956)", "NONE" },
//				{ "갑9", "false", "2007년4월2일", "소멸", "가압류", "", "[신용보증기금]",
//						"금571,378,208원", "의정부지방법원의가압류결정(2007카단50308)",
//						"금571,378,208원" }, };
//		assert사항(ok, expected);
	}
	*/
	public void test압류국() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<등기부등본_사항> ok = parser
				.parseAll("fixtures/압류 국.pdf", new String[] { "김중원" });
//		print(ok);
//		String[][] expected = {
//				{ "갑1", "false", "1995년2월23일", "소멸", "소유권보존", "소유권보존",
//						"[(주)한미은행, 한광동]", "NONE", "", "NONE" },
//				{ "을4", "false", "2000년12월22일", "소멸기준", "근저당권", "", "[중소기업은행]",
//						"삼억육천만원", "설정계약", "삼억육천만원" },
//				{ "을5", "false", "2001년9월20일", "소멸", "근저당권", "", "[중소기업은행]",
//						"금500,000,000원", "설정계약", "금500,000,000원" },
//				{ "을9", "false", "2006년7월3일", "소멸", "근저당권", "", "[중소기업은행]",
//						"금100,000,000원", "설정계약", "금100,000,000원" },
//				{ "을10", "false", "2006년11월17일", "소멸", "근저당권", "", "[신용보증기금]",
//						"금300,000,000원", "설정계약", "금300,000,000원" },
//				{ "을11", "false", "2006년11월24일", "소멸", "근저당권", "", "[나토상사]",
//						"금100,000,000원", "설정계약", "금100,000,000원" },
//				{ "갑2", "false", "2006년11월29일", "소멸", "가압류", "",
//						"[(주)한미은행, 기술신용보증기금]", "금265,000,000원",
//						"의정부지방법원의가압류결정(2006카단51083)", "금265,000,000원" },
//				{ "갑3", "false", "2006년12월6일", "소멸", "가압류", "",
//						"[(주)한미은행, 경기신용보증재단]", "금56,644,000원",
//						"의정부지방법원의가압류결정(2006카단7518)", "금56,644,000원" },
//				{ "을10-1", "false", "2007년1월8일", "소멸", "가처분", "10번근저당권",
//						"[기술신용보증기금]", "NONE", "의정부지방법원의가처분결정(2006카합878)",
//						"NONE" },
//				{ "을11-1", "false", "2007년1월8일", "소멸", "가처분", "11번근저당권",
//						"[기술신용보증기금]", "NONE", "의정부지방법원의가처분결정(2006카합878)",
//						"NONE" },
//				{ "갑4", "false", "2007년1월22일", "소멸", "가압류", "", "[(주)국민은행]",
//						"금476,213,642원", "서울중앙지방법원의가압류결정(2007카단32766)",
//						"금476,213,642원" },
//				{ "갑5", "false", "2007년1월29일", "소멸", "임의경매", "", "[중소기업은행]",
//						"NONE", "서울중앙지방법원의경매개시결정(2007타경2764)", "NONE" },
//				{ "갑6", "false", "2007년2월8일", "소멸", "가압류", "", "[서울보증보험(주)]",
//						"금56,072,770원", "서울중앙지방법원의가압류결정(2007카단37260)",
//						"금56,072,770원" },
//				{ "갑7", "false", "2007년2월23일", "소멸", "가압류", "", "[서울보증보험(주)]",
//						"금9,089,600원", "서울중앙지방법원의가압류결정(2007카단40290)",
//						"금9,089,600원" },
//				{ "갑8", "false", "2007년3월7일", "소멸", "압류", "", "[의정부세무서]",
//						"NONE", "압류(세원관리3과-956)", "NONE" },
//				{ "갑9", "false", "2007년4월2일", "소멸", "가압류", "", "[신용보증기금]",
//						"금571,378,208원", "의정부지방법원의가압류결정(2007카단50308)",
//						"금571,378,208원" }, };
//		assert사항(ok, expected);
	}
	
	
	
	public void test압류국2() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<등기부등본_사항> ok = parser
				.parseAll("fixtures/압류 국2.pdf", new String[] { "김태윤" });
//		print(ok);
	}
	
	public void test가압류가표시않됨압() throws Exception {
		등기부등본Parser parser = new 등기부등본Parser();
		List<등기부등본_사항> ok = parser
				.parseAll("fixtures/가압류가 표현안됨.pdf", new String[] { "김용수" });
		print(ok);
	}
	
	private void print(List<등기부등본_사항> it) {
//		System.out
//				.println("-------------------------------------------------------------------------------");
		for (등기부등본_사항 s : it) {
			s.processRight();
			String format1 = "%-5s:%-5b:%-12s:%s:%s:%-20s:%s:%s:%s:  %s:\n";
			String format2 = "{\"%s\",\"%b\",\"%s\",\"%s\",\"%s\",\"%s\",\"%s\",\"%s\",\"%s\",\"%s\"},\n";

//			System.out.format(format2, (s.getStage() == 1 ? "갑" : "을")
//					+ s.getText(), s.willDelete(), s.getAcceptDate(), s
//					.getFlagString(), s.flat(s.getPurpose()), s.flat(s
//					.getBigo()),
//
//			s.getRightPeoples(), s.getRightPrice(), s.flat(s.getBecause()), s
//					.getRightPrice());
		}
	}

	public void testRegx2() {
		assertText("가등기", "소유권이전청구권", "소유권이전청구권가등기");
		assertText("가등기", "소유권이전담보", "소유권이전담보가등기");
		assertText("가등기", "지분전부소유권이전청구권", "지분전부소유권이전청구권가등기");
		assertText("가등기", "지분전부이전청구권", "지분전부이전청구권가등기");

		// 청구권이지만, 요구사항에 가등기로 하게 되어 있음.
		assertText("가등기", "공유자전원지분전부이전청구권", "공유자전원지분전부이전청구권");
		// 이것도 확인해봐야 함.

		assertText("가압류", "", "가압류");
		assertText("가압류", "지분", "지분가압류");
		assertText("가압류", "지분전부", "지분전부가압류");

		assertText("가처분", "", "가처분");
		assertText("가처분", "가등기소유권이전청구권", "가등기소유권이전청구권가처분");
		assertText("가처분", "지분", "지분가처분");

		assertText("소유권이전", "55.1분의2.2홍길동22분의11홍길동전부이전",
				"55.1분의2.2홍길동22분의11홍길동전부이전");
		assertText("소유권이전", "55.1지분전부및11.2지분일부이전", "55.1지분전부및11.2지분일부이전");

		assertText("소유권이전", "공유자전원의지분전부이전", "공유자전원의지분전부이전");
		assertText("소유권이전", "공유자전원지분전부이전", "공유자전원지분전부이전");

		assertText("소유권이전", "공유지분이전", "공유지분이전");

		assertText("소유권이전", "홍길동 지분55.2분의11.1중 일부(11.1분의22.2)이전",
				"홍길동 지분55.2분의11.1중 일부(11.1분의22.2)이전");
		assertText("소유권이전", "홍길동 지분전부이전", "홍길동 지분전부이전");

		assertText("소유권이전", "홍길동지분55.2분지중11.1분지22.2이전",
				"홍길동지분55.2분지중11.1분지22.2이전");

		assertText("소유권이전", "일부이전", "일부이전");
		assertText("소유권이전", "지분이전", "지분이전");
		assertText("소유권이전", "지분전부소유권이전", "지분전부소유권이전");
		assertText("소유권이전", "지분전부이전", "지분전부이전");

		assertText("압류", "", "압류");
		assertText("압류", "지분", "지분압류");
		assertText("압류", "지분전부", "지분전부압류");

		// 이것도 확인해봐야 함.
		assertText("예고등기", "말소", "말소예고등기");

		assertText("예고등기", "소유권말소", "소유권말소예고등기");
		assertText("예고등기", "", "예고등기");
		assertText("예고등기", "지상권말소", "지상권말소예고등기");

		assertText("임의경매", "", "임의경매개시결정");
		assertText("임의경매", "지분", "지분임의경매개시결정");
		assertText("임의경매", "지분전부", "지분전부임의경매신청");

		assertText("임차권", "상가건물", "상가건물임차권");
		assertText("임차권", "주택", "주택임차권");

		assertText("저당권", "", "저당권설정");
		assertText("전세권", "", "전세권설정");
		assertText("지상권", "", "지상권설정");
		assertText("환매특약", "", "환매특약");
	}

	public void assertText(String ex1, String ex2, String src) {
		assertEquals(ex1, 등기부등본_사항.parsePurpose(src));
		assertEquals(ex2, 등기부등본_사항.parsePurposeBigo(src));
	}

	/**
	 * @param ok
	 * @param expected
	 */
	private void assert사항(List<등기부등본_사항> ok, String[][] expected) {
		assertEquals(expected.length, ok.size());
		for (int i = 0; i < expected.length; i++) {
			등기부등본_사항 s = ok.get(i);
			s.processRight();
			assertEquals("" + i, expected[i][0],
					(s.getStage() == 1 ? "갑" : "을") + s.getText());
			assertEquals("" + i, expected[i][1], "" + s.willDelete());
			assertEquals("" + i, expected[i][2], s.getAcceptDate());
			assertEquals("" + i, expected[i][3], s.getFlagString());
			assertEquals("" + i, expected[i][4], s.flat(s.getPurpose()));
			assertEquals("" + i, expected[i][5], s.flat(s.getBigo()));
			assertEquals("" + i, expected[i][6], "" + s.getRightPeoples());
			assertEquals("" + i, expected[i][7], s.getRightPrice());
			assertEquals("" + i, expected[i][8], s.flat(s.getBecause()));
			assertEquals("" + i, expected[i][9], s.getRightPrice());
		}
	}

}
